Diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
//{Левшина ВКМ_Диплом
#Область ОписаниеПеременных
 
Перем ДатаДокумента; 
Перем СотрудникПредыдущий;
Перем НомерДокумента; 

#КонецОбласти 
 
#Область ОбработчикиСобытий 

Процедура ОбработкаПроведения(Отказ,Режим)
	
	ВыполненныеКлиентуРаботы();	
	ВыполненныеСотрудникомРаботы();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Перем ОбщегоНазначения;
	Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Выбранный договор не является типом: Абонентское обслуживание");
		
	КонецЕсли;
	
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Если Не (Дата >= Договор.ВКМ_НачалоДействияДоговора И Дата <= Договор.ВКМ_ОкончаниеДействияДоговора) Тогда
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Дата документа не попадает в рамки выбранного договора");
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыполненныеСотрудникомРаботы()
	
	ПроцентОтРабот = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.УсловияОплатыСотрудников(Сотрудник, Дата); 
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина; 
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	
	Для Каждого Строка Из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Движение.ЧасовКОплате * Договор.ВКМ_СтоимостьЧасаРаботы * ПроцентОтРабот/100;
		
	КонецЦикла;
	
	//формула расчета суммы
	//ЧасовКОплатеКлиенту * СтавкаЧасаКлиента * ПроцентОтРабот / 100	
	
КонецПроцедуры

Процедура ВыполненныеКлиентуРаботы()
	
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы  
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	Для Каждого Строка Из ВыполненныеРаботы Цикл 
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;	
		Движение.КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Договор.ВКМ_СтоимостьЧасаРаботы * Движение.КоличествоЧасов;
		
	КонецЦикла;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
КонецПроцедуры  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	
	Если Не ЭтоНовый() Тогда 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.Сотрудник КАК Сотрудник,
		|	ВКМ_ОбслуживаниеКлиента.Номер КАК Номер
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка"; 
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		
		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			ДатаДокумента = Выборка.Дата; 
			СотрудникПредыдущий = Выборка.Сотрудник;
			НомерДокумента = Выборка.Номер;
		КонецЕсли; 
	КонецЕсли;  	
	
КонецПроцедуры 	
 
Процедура ПриЗаписи(Отказ) 
	
	Если ДатаДокумента <> Дата И СотрудникПредыдущий <> Сотрудник И ДатаДокумента <> Дата И СотрудникПредыдущий <> Сотрудник Тогда
		СпрОбъект = Справочники.ВКМ_Уведомления_Телеграм_Боту.СоздатьЭлемент();
		СпрОбъект.Текст_Сообщения = СтрШаблон("Создан новый документ ""Обслуживание клиента"", назначенный специалист: %1", Сотрудник);
		СпрОбъект.Записать();
			
		
	ИначеЕсли ДатаДокумента <> Дата Тогда 
		
		СпрОбъект = Справочники.ВКМ_Уведомления_Телеграм_Боту.СоздатьЭлемент();
		СпрОбъект.Текст_Сообщения = СтрШаблон("В документе ""Обслуживание клиента"" № %1, изменена дата!", НомерДокумента);
		СпрОбъект.Записать(); 		
		
	ИначеЕсли СотрудникПредыдущий <> Сотрудник Тогда 
		
		СпрОбъект = Справочники.ВКМ_Уведомления_Телеграм_Боту.СоздатьЭлемент();
		
		СпрОбъект.Текст_Сообщения = СтрШаблон("В документе ""Обслуживание клиента"" № %1, изменен специалист! Новый назначенный специалист: %2", НомерДокумента, Сотрудник);
		СпрОбъект.Записать();
		
	
	ИначеЕсли ДатаДокумента <> Дата И СотрудникПредыдущий <> Сотрудник Тогда 
		
		СпрОбъект = Справочники.ВКМ_Уведомления_Телеграм_Боту.СоздатьЭлемент();
		
		СпрОбъект.Текст_Сообщения = СтрШаблон("В документе ""Обслуживание клиента"" № %1, изменена дата и специалист! Новый назначенный специалист: %2", НомерДокумента, Сотрудник);
		СпрОбъект.Записать();
		
	КонецЕсли; 
	
	
КонецПроцедуры

#КонецОбласти
